---
kind: enumMember
id: F:Autodesk.Revit.DB.LeaderAtachement.Midpoint
enum: Autodesk.Revit.DB.LeaderAtachement
source: html/82ed0368-6da3-53a3-8c07-4061efd0be56.htm
---
# Autodesk.Revit.DB.LeaderAtachement.Midpoint

Leaders are aligned vertically with the midpoint of the text box and their shoulder line
 always ends at the box' border regardless of whether the border is visible on not.